/*
Lection 1 - JavaScript Intro
  * JS Введение
  * Подключение скриптов
  * Скрипты в отдельных файлах
  * Именование переменных
  * Переменные + типы(String, Number),  NaN,
  * Операторы
  * Приведение типов(явное, неявное)
  * Консоль разработчика
  * debugger
  * ? Операторы (+= \ ++)
*/

/*
  # 1. JS Введение
   * LiveScript - JavaScript;
   * JavaScript — это язык программирования, который даёт возможность реализовывать сложное 
     поведение веб-страницы. Является интерпретируемым языком.
   * Интерпретация – это когда исходный код программы получает другой инструмент, который называют «интерпретатор», 
     выполняет его «как есть». При этом распространяется именно сам исходный код (скрипт). 
     Этот подход применяется в браузерах для JavaScript. 
*/


// ------------------------/




// -------------------- //
